{"messages":[{"user":"l4m4rrrr","message":"là on est que tout les deux ( mais qu'est ce qui nous arrive ? (dsl ^^'))"},{"user":"leperroquetrose","message":"b"},{"user":"leperroquetrose","message":"u"},{"user":"l4m4rrrr","message":"du coup tu vie du dev ? t'as l'air de toucher"},{"user":"l4m4rrrr","message":"moi je bosse de nuit dans le médico social ( je suis aide médico psychologique, c'est niveau bac )"},{"user":"l4m4rrrr","message":"xD, je bosse avec des personnes handicapée, retard mental et / ou trouble psy"},{"user":"l4m4rrrr","message":"GG"},{"user":"l4m4rrrr","message":"tu peu avoir du retard mental sans trouble et inversement"},{"user":"l4m4rrrr","message":"ouais mais j'bosse tres souvent avec des débiles finit ( en tant qu'encadrent). Les metiers a forte valeur humaine ajouté attire pas, et quand tous les degouté partent , il reste que les degoutant"},{"user":"l4m4rrrr","message":"quand t'as des gens con (limite bête et mechant) avec des responsabilité sur d'autre, c'est pas facile"},{"user":"l4m4rrrr","message":"j'aime bien mon taff, mais pas tout mes collegue, je serai bien contant d'aller bosser dans l'info j'en ai un peu mare"},{"user":"l4m4rrrr","message":"informatique"},{"user":"l4m4rrrr","message":"apres c'est pas la majorité des collègue, mais ça suffit pour me demotiver"},{"user":"l4m4rrrr","message":"moi j'ai des troubles ( ancienne enfant tdah ++). Des soucis avec l'arbitraire et l'injuste . Apres j'ai un bon qi pour rattraper le truc mais blasé"},{"user":"l4m4rrrr","message":"2 a 5 pourcent de la population"},{"user":"l4m4rrrr","message":"possible que ça augmente chez les jeunes, moi c'est stats chez les adultes"},{"user":"l4m4rrrr","message":"oui c'est multifactoriel, ya un impacte educatif non négligeable. Mais ya aussi une grosse augmentation des perturbateur endocrinien qui font que le neuro devellopement est affecté"},{"user":"l4m4rrrr","message":"qué ?"},{"user":"l4m4rrrr","message":"!createNode"},{"user":"l4m4rrrr","message":"createNode"},{"user":"leperroquetrose","message":"createNode"},{"user":"leperroquetrose","message":"createNode"},{"user":"l4m4rrrr","message":"Les soucis avec l'arbitraire et l'injuste parait que c'est un classique chez les tdah, je vais ptete dire des connerie mais on est pas complétement neurotypique comme les autistes. On a pas les filtres, et les choses qui aident a rentrer dans le moule"},{"user":"l4m4rrrr","message":"j'ai un nœud rose <3"},{"user":"l4m4rrrr","message":"ouais bah en france lache l'affaire, on utilise encore la psychanalyse pour l'accompagnement des personnes autiste ( ya aucun resultat). De l'autre coté de l'atlantique c'est neuroscience a mort, et ça marche"},{"user":"l4m4rrrr","message":"en psychiatrie parait qu'on a 20 ans de retard sur le reste de l'europe"},{"user":"l4m4rrrr","message":"je suis tres loin d’être expert, j'ai des notions yep"},{"user":"l4m4rrrr","message":"je veux pas que mon nœud touche ton nœud, on se connait pas encore tres bien"},{"user":"l4m4rrrr","message":"MyAvatar MyAvatar"},{"user":"l4m4rrrr","message":"oui en général les command bot, discord twitch etc..  ! c'est un classique"},{"user":"l4m4rrrr","message":"mon nœud rose"},{"user":"l4m4rrrr","message":"le principe des science molle"},{"user":"l4m4rrrr","message":"apres ya des bases solide qui commencent a se construire en neuroscience"},{"user":"l4m4rrrr","message":"avec l'imagerie médical, l'ia etc.."},{"user":"l4m4rrrr","message":"on a réussi a prouver la qualia ya pas longtemps, genre mon rouge c'est ton rouge ( sauf si t'es daltonien)"},{"user":"l4m4rrrr","message":"ouais, en tout cas ya des etudes dessus"},{"user":"l4m4rrrr","message":"encéphalogramme + ia sur des personnes a qui ont faire regarder des images"},{"user":"l4m4rrrr","message":"l'ia arrive a interpreter ce que les gens voient"},{"user":"l4m4rrrr","message":"juste avec l'irm"},{"user":"l4m4rrrr","message":"(on parle de la meme chose )"},{"user":"l4m4rrrr","message":"oui c'est une physicienne sabinne, elle trolle souvent mais elle a des argument pour"},{"user":"l4m4rrrr","message":"t'as une idée de l'algo utilisé pour calculé les distances et les angles entre les nodes ?"},{"user":"l4m4rrrr","message":"oui mais en pro on fait pleins de petite fonction pour les métrique d’analyse genre jenkins. Taille des fonctions, complexité etc .."},{"user":"l4m4rrrr","message":"en théorit c'est plus simple a entretenir ( quand c'est bien fait, c'est SOLID)"},{"user":"l4m4rrrr","message":"distances et les angles -> placement 3D. A partir des matrice de chaque points ( connexion)"},{"user":"l4m4rrrr","message":"sur un grand projet, ouais les tests a chaques fonctionnalité, pour éviter les régressions"},{"user":"l4m4rrrr","message":"avec gemini, j'ai pété de tests, sinon il passe son temps a faire de la mouise ^^'"},{"user":"l4m4rrrr","message":"là je suis en l3 chef de projet, on a des métrique, des stats, nombre d'erreur moyenne par humain pour 1000 lignes de code"},{"user":"l4m4rrrr","message":"nombre d'erreur toléré en fonction du type de programme etc .."},{"user":"l4m4rrrr","message":"j'ai passé mon exam j'ai tout oublié xD"},{"user":"l4m4rrrr","message":"je peux aller regarder"},{"user":"l4m4rrrr","message":"ok, t'as une heuristique a la con pour calculer le truc. Parce que pour de vrai c'est le gros bordel a calculer"},{"user":"l4m4rrrr","message":"je parle des noeud"},{"user":"l4m4rrrr","message":"c'est exponanciel"},{"user":"l4m4rrrr","message":"c'est des simplification mathématique/algorithme pour syntétiser un pb réel, a partir d'approximation"},{"user":"l4m4rrrr","message":"Logiciels sur mesure et projets internes : ce type de projets, développés spécifiquement pour un usage interne (sans contrainte commerciale forte), peut présenter un taux de défauts assez élevé, pouvant atteindre 15 à 20 défauts par KLS, surtout si les pratiques de développement et de test ne sont pas très rigoureuses.  Logiciels commerciaux : le taux de défauts peut varier de 1 à 10 défauts par KLS."},{"user":"l4m4rrrr","message":"Systèmes embarqués (automobile, aéronautique, …) : compte-tenu de la criticité des systèmes et, de ce fait, des exigences de qualité extrêmement élevées, on observe des taux de défauts souvent inférieurs à 1 par KLS."},{"user":"l4m4rrrr","message":"Systèmes critiques pour la sécurité (contrôle du trafic aérien, systèmes de contrôle des réacteurs nucléaires, …) : les processus de développement et de vérification étant extrêmement stricts, on atteint un taux de défauts proche de zéro par KLS"},{"user":"l4m4rrrr","message":"voilà yep, bah ça va ton truc a l'air mega propre"},{"user":"l4m4rrrr","message":"un defaut c'est pas forcement une erreur, c'est un soucis dans le code, il peu apparaitre dans des cas tres spécifique, t'as des defaut qui sont detecté super tard dans la vie du logiciel"},{"user":"l4m4rrrr","message":"erreur = action humaine, defaut = dans le logiciel, faute = dans le produit, panne = dans la fonction  ( ça avance pas a grand chose mais une erreur, ou un defaut n'entraine pas forcement une faute )"},{"user":"l4m4rrrr","message":"(ou une panne)"},{"user":"l4m4rrrr","message":"C'est dans mes cours de gestion de projet"},{"user":"l4m4rrrr","message":"ouais dsl ^^'"},{"user":"leperroquetrose","message":"!createNode"},{"user":"l4m4rrrr","message":"mdr"},{"user":"leperroquetrose","message":"!connectTo:peer_8"},{"user":"leperroquetrose","message":"!connectTo:peer_8"},{"user":"l4m4rrrr","message":"MyAvatar"},{"user":"leperroquetrose","message":"!connectTo:peer_19"},{"user":"l4m4rrrr","message":"!connectTo:peer_21"},{"user":"leperroquetrose","message":"!createNode"},{"user":"leperroquetrose","message":"!createNode"},{"user":"l4m4rrrr","message":"pour trouver des peers"},{"user":"l4m4rrrr","message":"quand je trouve pas, je change d'ip avec mon vpn, ça aide un peu"},{"user":"l4m4rrrr","message":"oui mais là c'est des gros math non ? blockchain, peertopeer, ya des gros heuristique"},{"user":"l4m4rrrr","message":"ouais, moi j'vais my mettre un jour, au math, quand j'aurai le courage xD"},{"user":"l4m4rrrr","message":"oui ya des pattern, les gens qui connaissent ils ont des repères"},{"user":"l4m4rrrr","message":"ya des génie aussi"},{"user":"l4m4rrrr","message":"oui t'as bien expliqué ton truc"},{"user":"l4m4rrrr","message":"c'est pas parce qu'on a pas tous les outils qu'on est con ;p"},{"user":"l4m4rrrr","message":"ouais un hash classique, pleins de valeur pour éviter les collisions"},{"user":"l4m4rrrr","message":"cool, connaissait pas"},{"user":"l4m4rrrr","message":"si ça t'interesse de te former, je suis sur un salon ou on se partage les cours du cnam"},{"user":"l4m4rrrr","message":"ya des math, de l'info un peu de tout ( si ta envi de te faire du mal )"},{"user":"l4m4rrrr","message":"ya des gens aussi qui optimisent leur assembly"},{"user":"l4m4rrrr","message":"voir qui recode certaine parti  de leur code en assembleur pour que ce soit plus perf ( genre l'equipe de vlc elle fait ça sur certain codec )"},{"user":"l4m4rrrr","message":"le stream de vlc, ya un épisode de mycode dessus (c'est un peu pute a clique comme émission, mais souvent c'est intéressant )"},{"user":"l4m4rrrr","message":"why not, j'suis assez noob ;p"},{"user":"l4m4rrrr","message":"j'ai eu 17 a l'ecole en android, mais c'est parce que j'etais le seul a passer l'examen ( 1500 pages de cours, ça a decourager tout le monde )"},{"user":"l4m4rrrr","message":"plus t'en sait, plus te rend compte que t'es noob"},{"user":"l4m4rrrr","message":"ouais xD"},{"user":"l4m4rrrr","message":"le seul survivant ils l'ont choyé les prof tkt"},{"user":"l4m4rrrr","message":"pareil, merci pour le stream, j'te dis bonne soirée"},{"user":"l4m4rrrr","message":"cool, j'suis fiché dans la liste des noeuds, j'en demandais pas tant xD"},{"user":"l4m4rrrr","message":"ouf, aller ++"},{"user":"l4m4rrrr","message":"et si tu veux des cours du cned"},{"user":"l4m4rrrr","message":"pm sur discord"},{"user":"leperroquetrose","message":"alright merci :)"},{"user":"leperroquetrose","message":"pour les faire pré macher par l'IA"}]}